In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [6]:
a=['rohan','pawan','sam']
pr=pd.Series(a)
print(pr)

0    rohan
1    pawan
2      sam
dtype: object

In [7]:
b=[33,45,66,89,97]
f=pd.Series(b)
print(f)

0    33
1    45
2    66
3    89
4    97
dtype: int64

In [13]:
g=["rohan","13-03-1999",99]
g=pd.Series(g,index=["name","DOB","score"])
g

name          rohan
DOB      13-03-1999
score            99
dtype: object

In [14]:
name=["Rohan","pawan","sam","nikhil","ron","ren"]
city=["vashi","panvel","Nehrul","pune","oldpanvel","belapur"]
srno=[1,2,3,4,5,6]
user={"Name":name,"City":city,"Index":srno}
user

{'Name': ['Rohan', 'pawan', 'sam', 'nikhil', 'ron', 'ren'],
 'City': ['vashi', 'panvel', 'Nehrul', 'pune', 'oldpanvel', 'belapur'],
 'Index': [1, 2, 3, 4, 5, 6]}

In [16]:
d=pd.DataFrame(user)
print(d)

     Name       City  Index
0   Rohan      vashi      1
1   pawan     panvel      2
2     sam     Nehrul      3
3  nikhil       pune      4
4     ron  oldpanvel      5
5     ren    belapur      6

In [18]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   City    6 non-null      object
 2   Index   6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [19]:
d["Name"]

0     Rohan
1     pawan
2       sam
3    nikhil
4       ron
5       ren
Name: Name, dtype: object

In [23]:
d[["Name","City"]]

     Name       City
0   Rohan      vashi
1   pawan     panvel
2     sam     Nehrul
3  nikhil       pune
4     ron  oldpanvel
5     ren    belapur

In [24]:
d.iloc[0:2]

    Name    City  Index
0  Rohan   vashi      1
1  pawan  panvel      2

In [26]:
d.loc[0:5,"City"]

0        vashi
1       panvel
2       Nehrul
3         pune
4    oldpanvel
5      belapur
Name: City, dtype: object

In [29]:
p=pd.read_csv("C:/Users/admin/anaconda3/pkgs/astropy-5.0.4-py39h080aedc_0/Lib/site-packages/astropy/timeseries/tests/data/binned.csv")
k=pd.DataFrame(p)
k

,time_start,bin_size,time_end,A,B,C,D,E,F
0,2016-03-22T12:30:31.000,3,2016-03-22T12:30:34.000,164.93,114.73,26.27,19.21,28.87,63.44
1,2016-03-22T12:30:34.000,3,2016-03-22T12:30:37.000,164.89,114.75,26.22,19.07,27.76,59.98
2,2016-03-22T12:30:37.000,3,2016-03-22T12:30:40.000,164.63,115.04,25.78,19.01,27.04,59.61
3,2016-03-22T12:30:40.000,3,2016-03-22T12:30:43.000,163.92,114.85,27.41,19.61,27.84,59.41
4,2016-03-22T12:30:43.000,3,2016-03-22T12:30:46.000,163.45,114.84,26.86,19.53,28.02,60.09
5,2016-03-22T12:30:46.000,3,2016-03-22T12:30:49.000,163.46,115.40,27.09,19.72,28.25,59.62
6,2016-03-22T12:30:49.000,3,2016-03-22T12:30:52.000,163.22,115.56,27.13,19.63,28.24,58.65
7,2016-03-22T12:30:52.000,3,2016-03-22T12:30:55.000,164.02,115.54,26.74,19.55,28.43,59.20
8,2016-03-22T12:30:55.000,3,2016-03-22T12:30:58.000,163.59,115.72,27.82,20.21,29.17,56.18
9,2016-03-22T12:30:58.000,3,2016-03-22T12:31:01.000,163.32,115.11,28.22,20.42,29.38,56.64

In [31]:
p.head(5)

,time_start,bin_size,time_end,A,B,C,D,E,F
0,2016-03-22T12:30:31.000,3,2016-03-22T12:30:34.000,164.93,114.73,26.27,19.21,28.87,63.44
1,2016-03-22T12:30:34.000,3,2016-03-22T12:30:37.000,164.89,114.75,26.22,19.07,27.76,59.98
2,2016-03-22T12:30:37.000,3,2016-03-22T12:30:40.000,164.63,115.04,25.78,19.01,27.04,59.61
3,2016-03-22T12:30:40.000,3,2016-03-22T12:30:43.000,163.92,114.85,27.41,19.61,27.84,59.41
4,2016-03-22T12:30:43.000,3,2016-03-22T12:30:46.000,163.45,114.84,26.86,19.53,28.02,60.09

In [32]:
p.tail(3)

,time_start,bin_size,time_end,A,B,C,D,E,F
7,2016-03-22T12:30:52.000,3,2016-03-22T12:30:55.000,164.02,115.54,26.74,19.55,28.43,59.20
8,2016-03-22T12:30:55.000,3,2016-03-22T12:30:58.000,163.59,115.72,27.82,20.21,29.17,56.18
9,2016-03-22T12:30:58.000,3,2016-03-22T12:31:01.000,163.32,115.11,28.22,20.42,29.38,56.64

In [33]:
p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   time_start  10 non-null     object
 1   bin_size    10 non-null     int64
 2   time_end    10 non-null     object
 3   A           10 non-null     float64
 4   B           10 non-null     float64
 5   C           10 non-null     float64
 6   D           10 non-null     float64
 7   E           10 non-null     float64
 8   F           10 non-null     float64
dtypes: float64(6), int64(1), object(2)
memory usage: 848.0+ bytes

In [34]:
p.describe()

,bin_size,A,B,C,D,E,F
count,10.0,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,3.0,163.943000,115.154000,26.954000,19.596000,28.300000,59.282000
std,0.0,0.654999,0.371729,0.749047,0.453167,0.702409,1.990979
min,3.0,163.220000,114.730000,25.780000,19.010000,27.040000,56.180000
25%,3.0,163.452500,114.842500,26.387500,19.290000,27.885000,58.787500
50%,3.0,163.755000,115.075000,26.975000,19.580000,28.245000,59.510000
75%,3.0,164.477500,115.505000,27.340000,19.697500,28.760000,59.890000
max,3.0,164.930000,115.720000,28.220000,20.420000,29.380000,63.440000

In [35]:
p.isnull().sum()

time_start    0
bin_size      0
time_end      0
A             0
B             0
C             0
D             0
E             0
F             0
dtype: int64

In [39]:
p.isnull()

   time_start  bin_size  time_end      A      B      C      D      E      F
0       False     False     False  False  False  False  False  False  False
1       False     False     False  False  False  False  False  False  False
2       False     False     False  False  False  False  False  False  False
3       False     False     False  False  False  False  False  False  False
4       False     False     False  False  False  False  False  False  False
5       False     False     False  False  False  False  False  False  False
6       False     False     False  False  False  False  False  False  False
7       False     False     False  False  False  False  False  False  False
8       False     False     False  False  False  False  False  False  False
9       False     False     False  False  False  False  False  False  False

In [40]:
p["A"].unique()

array([164.93, 164.89, 164.63, 163.92, 163.45, 163.46, 163.22, 164.02,
       163.59, 163.32])

In [41]:
p["B"].mean()

115.154

In [42]:
p["C"].sum()

269.53999999999996